[Killed] LogicalOperator
src/lib/api.ts:21:11
   payload: any;
 
   constructor(status: number, payload: any, message?: string) {
-    super(message || (payload && payload.message) || `API Error ${status}`);
+    super(message && payload && payload.message || `API Error ${status}`);
     this.name = "ApiError";
     this.status = status;
killedBy: ApiError creates an error with status and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Not Found"
Received: "API Error 404"

[Killed] ConditionalExpression
src/lib/api.ts:21:11
   payload: any;
 
   constructor(status: number, payload: any, message?: string) {
-    super(message || (payload && payload.message) || `API Error ${status}`);
+    super(false || `API Error ${status}`);
     this.name = "ApiError";
     this.status = status;
killedBy: ApiError creates an error with status and payload
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Not Found"
Received: "API Error 404"

[Killed] EqualityOperator
src/lib/api.ts:29:37
 }
 
 export function isRateLimitError(err: unknown): boolean {
-  return err instanceof ApiError && err.status === 429;
+  return err instanceof ApiError && err.status !== 429;
 }
 
killedBy: AdminProductsPage shows error when product load fails
statusReason: Error: Unable to find an element with the text: Impossible de charger la liste des produits. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ConditionalExpression
src/lib/api.ts:29:37
 }
 
 export function isRateLimitError(err: unknown): boolean {
-  return err instanceof ApiError && err.status === 429;
+  return err instanceof ApiError && true;
 }
 
killedBy: isRateLimitError returns false for ApiError with other status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/lib/api.ts:44:9
     // Call the real catalog service. The backend exposes GET /products with optional query params:
     // name, category, minPrice, maxPrice
     const params = new URLSearchParams();
-    if (filters?.name) params.set("name", filters.name);
+    if (true) params.set("name", filters.name);
     if (filters?.category) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
killedBy: OrdersPage displays orders after loading
statusReason: Error: Unable to find an element with the text: /3 commandes/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ConditionalExpression
src/lib/api.ts:44:9
     // Call the real catalog service. The backend exposes GET /products with optional query params:
     // name, category, minPrice, maxPrice
     const params = new URLSearchParams();
-    if (filters?.name) params.set("name", filters.name);
+    if (false) params.set("name", filters.name);
     if (filters?.category) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
killedBy: CatalogPage submits search form with filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "name=Laptop"
Received string:    "http://localhost:4000"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/lib/api.ts:45:9
     // name, category, minPrice, maxPrice
     const params = new URLSearchParams();
     if (filters?.name) params.set("name", filters.name);
-    if (filters?.category) params.set("category", filters.category);
+    if (true) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
       params.set("minPrice", String(filters.minPrice));
killedBy: catalogService getProducts calls fetch and returns products array
statusReason: TypeError: Cannot read properties of undefined (reading 'category')

[Killed] ConditionalExpression
src/lib/api.ts:45:9
     // name, category, minPrice, maxPrice
     const params = new URLSearchParams();
     if (filters?.name) params.set("name", filters.name);
-    if (filters?.category) params.set("category", filters.category);
+    if (false) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
       params.set("minPrice", String(filters.minPrice));
killedBy: catalogService getProducts passes query params for filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "category=Informatique"
Received string:    "http://localhost:4000/?name=laptop&minPrice=100&maxPrice=2000"

[Killed] ConditionalExpression
src/lib/api.ts:46:9
     const params = new URLSearchParams();
     if (filters?.name) params.set("name", filters.name);
     if (filters?.category) params.set("category", filters.category);
-    if (filters?.minPrice !== undefined)
+    if (true)
       params.set("minPrice", String(filters.minPrice));
     if (filters?.maxPrice !== undefined)
killedBy: OrdersPage displays orders after loading
statusReason: Error: Unable to find an element with the text: /3 commandes/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ConditionalExpression
src/lib/api.ts:46:9
     const params = new URLSearchParams();
     if (filters?.name) params.set("name", filters.name);
     if (filters?.category) params.set("category", filters.category);
-    if (filters?.minPrice !== undefined)
+    if (false)
       params.set("minPrice", String(filters.minPrice));
     if (filters?.maxPrice !== undefined)
killedBy: CatalogPage filters by min/max price
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "minPrice=100"
Received string:    "http://localhost:4000/?maxPrice=1000"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
src/lib/api.ts:48:9
     if (filters?.category) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
       params.set("minPrice", String(filters.minPrice));
-    if (filters?.maxPrice !== undefined)
+    if (filters?.maxPrice === undefined)
       params.set("maxPrice", String(filters.maxPrice));
 
killedBy: OrdersPage displays orders after loading
statusReason: Error: Unable to find an element with the text: /3 commandes/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ConditionalExpression
src/lib/api.ts:48:9
     if (filters?.category) params.set("category", filters.category);
     if (filters?.minPrice !== undefined)
       params.set("minPrice", String(filters.minPrice));
-    if (filters?.maxPrice !== undefined)
+    if (false)
       params.set("maxPrice", String(filters.maxPrice));
 
killedBy: CatalogPage filters by min/max price
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "maxPrice=1000"
Received string:    "http://localhost:4000/?minPrice=100"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/lib/api.ts:54:7
     // In development use CRA dev proxy (relative paths); in production call configured API_CONFIG directly
     const url = buildUrl(
       "CATALOG",
-      `${params.toString() ? `?${params.toString()}` : ""}`
+      ``
     );
     try {
killedBy: CatalogPage submits search form with filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "name=Laptop"
Received string:    "http://localhost:4000"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/lib/api.ts:58:11
     );
     try {
       const data = await doFetch(url, { method: "GET" });
-      if (!Array.isArray(data))
+      if (true)
         throw new ApiError(200, data, "Invalid payload from catalog service");
       return data as Product[];
killedBy: CatalogPage displays products after loading
statusReason: Error: Unable to find an element with the text: Laptop Pro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="toast-wrap"
    >

[Killed] BooleanLiteral
src/lib/api.ts:58:11
     );
     try {
       const data = await doFetch(url, { method: "GET" });
-      if (!Array.isArray(data))
+      if (Array.isArray(data))
         throw new ApiError(200, data, "Invalid payload from catalog service");
       return data as Product[];
killedBy: CatalogPage displays products after loading
statusReason: Error: Unable to find an element with the text: Laptop Pro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="toast-wrap"
    >

[Killed] StringLiteral
src/lib/api.ts:59:39
     try {
       const data = await doFetch(url, { method: "GET" });
       if (!Array.isArray(data))
-        throw new ApiError(200, data, "Invalid payload from catalog service");
+        throw new ApiError(200, data, "");
       return data as Product[];
     } catch (err) {
killedBy: catalogService getProducts throws ApiError on invalid payload
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid payload from catalog service"
Received message:   "API Error 200"

      107 |             method: stryMutAct_9fa48("42") ? "" : (stryCov_9fa48("42"), "GET")
      108 |           }));

[Killed] BlockStatement
src/lib/api.ts:61:19
       if (!Array.isArray(data))
         throw new ApiError(200, data, "Invalid payload from catalog service");
       return data as Product[];
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to fetch products from catalog service", err);
-      throw err;
-    }
+    } catch (err) {}
   },
   async createProduct(payload: CreateProductPayload): Promise<Product> {
killedBy: catalogService getProducts throws ApiError on invalid payload
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/lib/api.ts:76:19
         body: JSON.stringify(payload),
       });
       return data as Product;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to create product", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: AdminProductsPage shows API error with payload message on create failure
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] StringLiteral
src/lib/api.ts:78:21
       return data as Product;
     } catch (err) {
       // eslint-disable-next-line no-console
-      console.error("Failed to create product", err);
+      console.error("", err);
       throw err;
     }

[Killed] BlockStatement
src/lib/api.ts:83:50
     }
   },
 
-  async deleteProduct(id: string): Promise<void> {
-    const url = buildUrl("CATALOG", `/${encodeURIComponent(id)}`);
-    try {
-      await doFetch(url, { method: "DELETE" });
-      return;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to delete product", err);
-      throw err;
-    }
-  },
+  async deleteProduct(id: string): Promise<void> {},
 };
 
killedBy: AdminProductsPage shows error when delete fails
statusReason: Error: Unable to find an element with the text: Erreur lors de la suppression. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] BlockStatement
src/lib/api.ts:85:9
 
   async deleteProduct(id: string): Promise<void> {
     const url = buildUrl("CATALOG", `/${encodeURIComponent(id)}`);
-    try {
-      await doFetch(url, { method: "DELETE" });
-      return;
-    } catch (err) {
+    try {} catch (err) {
       // eslint-disable-next-line no-console
       console.error("Failed to delete product", err);
killedBy: catalogService deleteProduct sends DELETE
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] StringLiteral
src/lib/api.ts:86:36
   async deleteProduct(id: string): Promise<void> {
     const url = buildUrl("CATALOG", `/${encodeURIComponent(id)}`);
     try {
-      await doFetch(url, { method: "DELETE" });
+      await doFetch(url, { method: "" });
       return;
     } catch (err) {
killedBy: catalogService deleteProduct sends DELETE
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DELETE"
Received: ""

[Killed] BlockStatement
src/lib/api.ts:88:19
     try {
       await doFetch(url, { method: "DELETE" });
       return;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to delete product", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 };
killedBy: AdminProductsPage shows error when delete fails
statusReason: Error: Unable to find an element with the text: Erreur lors de la suppression. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] BlockStatement
src/lib/api.ts:108:19
         body: JSON.stringify(payload),
       });
       return data as Order;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to create order", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: orderService createOrder re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/api.ts:118:49
   async getOrders(): Promise<Order[]> {
     const url = buildUrl("ORDERS", "");
     try {
-      const data = await doFetch(url, { method: "GET" });
+      const data = await doFetch(url, { method: "" });
       return data as Order[];
     } catch (err) {

[Killed] BlockStatement
src/lib/api.ts:120:19
     try {
       const data = await doFetch(url, { method: "GET" });
       return data as Order[];
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to fetch orders", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: orderService getOrders re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/api.ts:128:36
   },
 
   async getOrder(id: string): Promise<Order> {
-    const url = buildUrl("ORDERS", `/${encodeURIComponent(id)}`);
+    const url = buildUrl("ORDERS", ``);
     try {
       const data = await doFetch(url, { method: "GET" });

[Killed] BlockStatement
src/lib/api.ts:132:19
     try {
       const data = await doFetch(url, { method: "GET" });
       return data as Order;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to fetch order", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: orderService getOrder re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/lib/api.ts:144:17
     const url = buildUrl("ORDERS", `/${encodeURIComponent(id)}`);
     try {
       const data = await doFetch(url, {
-        method: "PATCH",
+        method: "",
         headers: { "Content-Type": "application/json" },
         body: JSON.stringify({ status }),
killedBy: orderService updateOrderStatus sends PATCH
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PATCH"
Received: ""

[Survived] StringLiteral
src/lib/api.ts:145:36
     try {
       const data = await doFetch(url, {
         method: "PATCH",
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
         body: JSON.stringify({ status }),
       });

[Survived] ObjectLiteral
src/lib/api.ts:145:18
     try {
       const data = await doFetch(url, {
         method: "PATCH",
-        headers: { "Content-Type": "application/json" },
+        headers: {},
         body: JSON.stringify({ status }),
       });

[Killed] BlockStatement
src/lib/api.ts:149:19
         body: JSON.stringify({ status }),
       });
       return data as Order;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to update order status", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 };
killedBy: orderService updateOrderStatus re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/api.ts:151:21
       return data as Order;
     } catch (err) {
       // eslint-disable-next-line no-console
-      console.error("Failed to update order status", err);
+      console.error("", err);
       throw err;
     }

[Survived] StringLiteral
src/lib/api.ts:161:37
 
 export const paymentService = {
   async createPayment(payload: CreatePaymentPayload): Promise<Payment> {
-    const url = buildUrl("PAYMENT", "");
+    const url = buildUrl("PAYMENT", "Stryker was here!");
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
     const body = {

[Survived] ObjectLiteral
src/lib/api.ts:163:18
   async createPayment(payload: CreatePaymentPayload): Promise<Payment> {
     const url = buildUrl("PAYMENT", "");
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
-    const body = {
-      orderId: (payload as any).order_id || (payload as any).orderId,
-      userId: (payload as any).user_id || (payload as any).userId,
-      amount: payload.amount,
-    };
+    const body = {};
 
     try {

[Survived] ConditionalExpression
src/lib/api.ts:164:16
     const url = buildUrl("PAYMENT", "");
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
     const body = {
-      orderId: (payload as any).order_id || (payload as any).orderId,
+      orderId: true,
       userId: (payload as any).user_id || (payload as any).userId,
       amount: payload.amount,

[Survived] LogicalOperator
src/lib/api.ts:164:16
     const url = buildUrl("PAYMENT", "");
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
     const body = {
-      orderId: (payload as any).order_id || (payload as any).orderId,
+      orderId: (payload as any).order_id && (payload as any).orderId,
       userId: (payload as any).user_id || (payload as any).userId,
       amount: payload.amount,

[Survived] ConditionalExpression
src/lib/api.ts:165:15
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
     const body = {
       orderId: (payload as any).order_id || (payload as any).orderId,
-      userId: (payload as any).user_id || (payload as any).userId,
+      userId: true,
       amount: payload.amount,
     };

[Survived] ConditionalExpression
src/lib/api.ts:165:15
     // Backend expects camelCase (orderId, userId) per docs — map payload accordingly
     const body = {
       orderId: (payload as any).order_id || (payload as any).orderId,
-      userId: (payload as any).user_id || (payload as any).userId,
+      userId: false,
       amount: payload.amount,
     };

[Survived] StringLiteral
src/lib/api.ts:172:36
     try {
       const parsed = await doFetch(url, {
         method: "POST",
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
         body: JSON.stringify(body),
       });

[Killed] LogicalOperator
src/lib/api.ts:179:19
       // Normalize backend response (camelCase) to frontend shape (snake_case)
       const payment: Payment = {
         id: parsed.id,
-        order_id: parsed.orderId ?? parsed.order_id,
+        order_id: parsed.orderId && parsed.order_id,
         user_id: parsed.userId ?? parsed.user_id,
         amount: parsed.amount,
killedBy: paymentService createPayment normalizes camelCase response to snake_case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "o1"
Received: undefined

[Killed] LogicalOperator
src/lib/api.ts:180:18
       const payment: Payment = {
         id: parsed.id,
         order_id: parsed.orderId ?? parsed.order_id,
-        user_id: parsed.userId ?? parsed.user_id,
+        user_id: parsed.userId && parsed.user_id,
         amount: parsed.amount,
         status: parsed.status,
killedBy: paymentService createPayment normalizes camelCase response to snake_case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "u1"
Received: undefined

[Killed] LogicalOperator
src/lib/api.ts:183:21
         user_id: parsed.userId ?? parsed.user_id,
         amount: parsed.amount,
         status: parsed.status,
-        created_at: parsed.createdAt ?? parsed.created_at,
+        created_at: parsed.createdAt && parsed.created_at,
       };
       return payment;
killedBy: paymentService createPayment normalizes camelCase response to snake_case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-01-01T00:00:00Z"
Received: undefined

[Killed] BlockStatement
src/lib/api.ts:186:19
         created_at: parsed.createdAt ?? parsed.created_at,
       };
       return payment;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to create payment", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: paymentService createPayment re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/api.ts:196:51
   async getPayments(): Promise<Payment[]> {
     const url = buildUrl("PAYMENT", "");
     try {
-      const parsed = await doFetch(url, { method: "GET" });
+      const parsed = await doFetch(url, { method: "" });
       const items = Array.isArray(parsed) ? parsed : [];
       return items.map((p: any) => ({

[Killed] ArrayDeclaration
src/lib/api.ts:197:54
     const url = buildUrl("PAYMENT", "");
     try {
       const parsed = await doFetch(url, { method: "GET" });
-      const items = Array.isArray(parsed) ? parsed : [];
+      const items = Array.isArray(parsed) ? parsed : ["Stryker was here"];
       return items.map((p: any) => ({
         id: p.id,
killedBy: paymentService getPayments handles non-array response
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 10

- Array []
+ Array [
+   Object {

[Killed] ArrowFunction
src/lib/api.ts:198:24
     try {
       const parsed = await doFetch(url, { method: "GET" });
       const items = Array.isArray(parsed) ? parsed : [];
-      return items.map((p: any) => ({
-        id: p.id,
-        order_id: p.orderId ?? p.order_id,
-        user_id: p.userId ?? p.user_id,
-        amount: p.amount,
-        status: p.status,
-        created_at: p.createdAt ?? p.created_at,
-      }));
+      return items.map(() => undefined);
     } catch (err) {
       // eslint-disable-next-line no-console
killedBy: PaymentPage displays payment statistics after loading
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
src/lib/api.ts:200:19
       const items = Array.isArray(parsed) ? parsed : [];
       return items.map((p: any) => ({
         id: p.id,
-        order_id: p.orderId ?? p.order_id,
+        order_id: p.orderId && p.order_id,
         user_id: p.userId ?? p.user_id,
         amount: p.amount,
killedBy: PaymentPage displays payment statistics after loading
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] LogicalOperator
src/lib/api.ts:201:18
       return items.map((p: any) => ({
         id: p.id,
         order_id: p.orderId ?? p.order_id,
-        user_id: p.userId ?? p.user_id,
+        user_id: p.userId && p.user_id,
         amount: p.amount,
         status: p.status,
killedBy: paymentService getPayments normalizes array of payments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "u1"
Received: undefined

[Killed] LogicalOperator
src/lib/api.ts:204:21
         user_id: p.userId ?? p.user_id,
         amount: p.amount,
         status: p.status,
-        created_at: p.createdAt ?? p.created_at,
+        created_at: p.createdAt && p.created_at,
       }));
     } catch (err) {
killedBy: paymentService getPayments handles snake_case response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-02-01T00:00:00Z"
Received: undefined

[Killed] BlockStatement
src/lib/api.ts:206:19
         status: p.status,
         created_at: p.createdAt ?? p.created_at,
       }));
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to fetch payments", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 
killedBy: PaymentPage shows error when API fails
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Survived] StringLiteral
src/lib/api.ts:208:21
       }));
     } catch (err) {
       // eslint-disable-next-line no-console
-      console.error("Failed to fetch payments", err);
+      console.error("", err);
       throw err;
     }

[Survived] StringLiteral
src/lib/api.ts:214:37
   },
 
   async getPayment(id: string): Promise<Payment> {
-    const url = buildUrl("PAYMENT", `/${encodeURIComponent(id)}`);
+    const url = buildUrl("PAYMENT", ``);
     try {
       const p = await doFetch(url, { method: "GET" });

[Killed] BlockStatement
src/lib/api.ts:225:19
         status: p.status,
         created_at: p.createdAt ?? p.created_at,
       } as Payment;
-    } catch (err) {
-      // eslint-disable-next-line no-console
-      console.error("Failed to fetch payment", err);
-      throw err;
-    }
+    } catch (err) {}
   },
 };
killedBy: paymentService getPayment re-throws on error
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/lib/api.ts:227:21
       } as Payment;
     } catch (err) {
       // eslint-disable-next-line no-console
-      console.error("Failed to fetch payment", err);
+      console.error("", err);
       throw err;
     }
