[Killed] EqualityOperator
src/lib/http.ts:5:36
 import { getToken } from "../services/keycloak";
 
 export const isDev =
-  typeof window !== "undefined" && process.env.NODE_ENV === "development";
+  typeof window !== "undefined" && process.env.NODE_ENV !== "development";
 
 function generateUUID(): string {
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/catalog"
Received: "http://localhost:4000"

[Killed] LogicalOperator
src/lib/http.ts:5:3
 import { getToken } from "../services/keycloak";
 
 export const isDev =
-  typeof window !== "undefined" && process.env.NODE_ENV === "development";
+  typeof window !== "undefined" || process.env.NODE_ENV === "development";
 
 function generateUUID(): string {
killedBy: http module buildUrl returns config URLs when NODE_ENV is production
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost:4000"
Received: "/api/catalog"

[NoCoverage] BlockStatement
src/lib/http.ts:8:81
   typeof window !== "undefined" && process.env.NODE_ENV === "development";
 
 function generateUUID(): string {
-  if (typeof crypto !== "undefined" && typeof crypto.randomUUID === "function") {
-    return crypto.randomUUID();
-  }
+  if (typeof crypto !== "undefined" && typeof crypto.randomUUID === "function") {}
   // Fallback for non-secure contexts (HTTP)
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {

[NoCoverage] ConditionalExpression
src/lib/http.ts:8:40
   typeof window !== "undefined" && process.env.NODE_ENV === "development";
 
 function generateUUID(): string {
-  if (typeof crypto !== "undefined" && typeof crypto.randomUUID === "function") {
+  if (typeof crypto !== "undefined" && true) {
     return crypto.randomUUID();
   }

[Survived] Regex
src/lib/http.ts:12:57
     return crypto.randomUUID();
   }
   // Fallback for non-secure contexts (HTTP)
-  return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
+  return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[^xy]/g, (c) => {
     const r = (Math.random() * 16) | 0;
     return (c === "x" ? r : (r & 0x3) | 0x8).toString(16);

[Survived] ConditionalExpression
src/lib/http.ts:14:13
   // Fallback for non-secure contexts (HTTP)
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
     const r = (Math.random() * 16) | 0;
-    return (c === "x" ? r : (r & 0x3) | 0x8).toString(16);
+    return (true ? r : (r & 0x3) | 0x8).toString(16);
   });
 }

[Survived] ConditionalExpression
src/lib/http.ts:14:13
   // Fallback for non-secure contexts (HTTP)
   return "xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx".replace(/[xy]/g, (c) => {
     const r = (Math.random() * 16) | 0;
-    return (c === "x" ? r : (r & 0x3) | 0x8).toString(16);
+    return (false ? r : (r & 0x3) | 0x8).toString(16);
   });
 }

[NoCoverage] BlockStatement
src/lib/http.ts:19:86
 }
 
 function generateHexId(bytes: number): string {
-  if (typeof crypto !== "undefined" && typeof crypto.getRandomValues === "function") {
-    const buf = new Uint8Array(bytes);
-    crypto.getRandomValues(buf);
-    return Array.from(buf, (b) => b.toString(16).padStart(2, "0")).join("");
-  }
+  if (typeof crypto !== "undefined" && typeof crypto.getRandomValues === "function") {}
   return Array.from({ length: bytes }, () =>
     Math.floor(Math.random() * 256).toString(16).padStart(2, "0")

[NoCoverage] EqualityOperator
src/lib/http.ts:19:40
 }
 
 function generateHexId(bytes: number): string {
-  if (typeof crypto !== "undefined" && typeof crypto.getRandomValues === "function") {
+  if (typeof crypto !== "undefined" && typeof crypto.getRandomValues !== "function") {
     const buf = new Uint8Array(bytes);
     crypto.getRandomValues(buf);

[NoCoverage] ArrowFunction
src/lib/http.ts:22:28
   if (typeof crypto !== "undefined" && typeof crypto.getRandomValues === "function") {
     const buf = new Uint8Array(bytes);
     crypto.getRandomValues(buf);
-    return Array.from(buf, (b) => b.toString(16).padStart(2, "0")).join("");
+    return Array.from(buf, () => undefined).join("");
   }
   return Array.from({ length: bytes }, () =>

[Survived] ArrowFunction
src/lib/http.ts:24:40
     crypto.getRandomValues(buf);
     return Array.from(buf, (b) => b.toString(16).padStart(2, "0")).join("");
   }
-  return Array.from({ length: bytes }, () =>
-    Math.floor(Math.random() * 256).toString(16).padStart(2, "0")
+  return Array.from({ length: bytes }, () => undefined
   ).join("");
 }

[Survived] ArithmeticOperator
src/lib/http.ts:25:16
     return Array.from(buf, (b) => b.toString(16).padStart(2, "0")).join("");
   }
   return Array.from({ length: bytes }, () =>
-    Math.floor(Math.random() * 256).toString(16).padStart(2, "0")
+    Math.floor(Math.random() / 256).toString(16).padStart(2, "0")
   ).join("");
 }

[Survived] StringLiteral
src/lib/http.ts:26:10
   }
   return Array.from({ length: bytes }, () =>
     Math.floor(Math.random() * 256).toString(16).padStart(2, "0")
-  ).join("");
+  ).join("Stryker was here!");
 }
 

[Killed] BlockStatement
src/lib/http.ts:40:14
 const _traceId = generateHexId(16);
 
 export function buildUrl(service: "CATALOG" | "ORDERS" | "PAYMENT", path = "") {
-  if (isDev) {
-    switch (service) {
-      case "CATALOG":
-        return `/api/catalog${path}`;
-      case "ORDERS":
-        return `/api/orders${path}`;
-      case "PAYMENT":
-        return `/api/payments${path}`;
-    }
-  }
+  if (isDev) {}
   const base = API_CONFIG[service];
   if (!path) return base;
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/catalog"
Received: "http://localhost:4000"

[Killed] ConditionalExpression
src/lib/http.ts:40:7
 const _traceId = generateHexId(16);
 
 export function buildUrl(service: "CATALOG" | "ORDERS" | "PAYMENT", path = "") {
-  if (isDev) {
+  if (false) {
     switch (service) {
       case "CATALOG":
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/catalog"
Received: "http://localhost:4000"

[Killed] ConditionalExpression
src/lib/http.ts:42:7
 export function buildUrl(service: "CATALOG" | "ORDERS" | "PAYMENT", path = "") {
   if (isDev) {
     switch (service) {
-      case "CATALOG":
-        return `/api/catalog${path}`;
+      case "CATALOG":
       case "ORDERS":
         return `/api/orders${path}`;
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/catalog"
Received: "/api/orders"

[Killed] StringLiteral
src/lib/http.ts:43:16
   if (isDev) {
     switch (service) {
       case "CATALOG":
-        return `/api/catalog${path}`;
+        return ``;
       case "ORDERS":
         return `/api/orders${path}`;
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/catalog"
Received: ""

[Killed] ConditionalExpression
src/lib/http.ts:44:7
     switch (service) {
       case "CATALOG":
         return `/api/catalog${path}`;
-      case "ORDERS":
-        return `/api/orders${path}`;
+      case "ORDERS":
       case "PAYMENT":
         return `/api/payments${path}`;
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/orders"
Received: "/api/payments"

[Killed] ConditionalExpression
src/lib/http.ts:46:7
         return `/api/catalog${path}`;
       case "ORDERS":
         return `/api/orders${path}`;
-      case "PAYMENT":
-        return `/api/payments${path}`;
+      case "PAYMENT":
     }
   }
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/payments"
Received: "http://localhost:8082"

[Killed] StringLiteral
src/lib/http.ts:47:16
       case "ORDERS":
         return `/api/orders${path}`;
       case "PAYMENT":
-        return `/api/payments${path}`;
+        return ``;
     }
   }
killedBy: http module buildUrl returns dev proxy paths when NODE_ENV is development
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/payments"
Received: ""

[Killed] ConditionalExpression
src/lib/http.ts:51:7
     }
   }
   const base = API_CONFIG[service];
-  if (!path) return base;
+  if (true) return base;
   const cleanBase = base.replace(/\/$/, "");
   const cleanPath = path.startsWith("/") ? path : `/${path}`;
killedBy: CatalogPage submits search form with filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "name=Laptop"
Received string:    "http://localhost:4000"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/lib/http.ts:51:7
     }
   }
   const base = API_CONFIG[service];
-  if (!path) return base;
+  if (path) return base;
   const cleanBase = base.replace(/\/$/, "");
   const cleanPath = path.startsWith("/") ? path : `/${path}`;
killedBy: CatalogPage submits search form with filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "name=Laptop"
Received string:    "http://localhost:4000"

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/lib/http.ts:52:41
   }
   const base = API_CONFIG[service];
   if (!path) return base;
-  const cleanBase = base.replace(/\/$/, "");
+  const cleanBase = base.replace(/\/$/, "Stryker was here!");
   const cleanPath = path.startsWith("/") ? path : `/${path}`;
   return `${cleanBase}${cleanPath}`;
killedBy: http module buildUrl cleans trailing slash from base before joining path
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://catalog.example.com/products"
Received: "http://catalog.example.comStryker was here!/products"

[Killed] MethodExpression
src/lib/http.ts:53:21
   const base = API_CONFIG[service];
   if (!path) return base;
   const cleanBase = base.replace(/\/$/, "");
-  const cleanPath = path.startsWith("/") ? path : `/${path}`;
+  const cleanPath = path.endsWith("/") ? path : `/${path}`;
   return `${cleanBase}${cleanPath}`;
 }
killedBy: http module buildUrl concatenates base and path in production
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost:4000/products"
Received: "http://localhost:4000//products"

[Killed] ObjectLiteral
src/lib/http.ts:59:48
 
 export async function doFetch(url: string, opts?: RequestInit) {
   const token = await getToken();
-  const traceHeaders: Record<string, string> = {
-    "X-Correlation-ID": _correlationId,
-    traceparent: buildTraceparent(_traceId),
-  };
+  const traceHeaders: Record<string, string> = {};
   if (token) {
     traceHeaders["Authorization"] = `Bearer ${token}`;
killedBy: http module doFetch injects Authorization and tracing headers
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "X-Correlation-ID"
Received path: []

Received value: {"Authorization": "Bearer mock-token"}

[Killed] BlockStatement
src/lib/http.ts:63:14
     "X-Correlation-ID": _correlationId,
     traceparent: buildTraceparent(_traceId),
   };
-  if (token) {
-    traceHeaders["Authorization"] = `Bearer ${token}`;
-  }
+  if (token) {}
 
   let res: Response;
killedBy: http module doFetch injects Authorization and tracing headers
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "Authorization"
Received path: []

Received value: {"X-Correlation-ID": "bf6cc232-eb4b-47e9-b418-f92f36f81ea6", "traceparent": "00-a2cdd51e5bbeca7a31a2501a64de9a93-4811974e3fdb054c-01"}

[Killed] StringLiteral
src/lib/http.ts:64:37
     traceparent: buildTraceparent(_traceId),
   };
   if (token) {
-    traceHeaders["Authorization"] = `Bearer ${token}`;
+    traceHeaders["Authorization"] = ``;
   }
 
killedBy: http module doFetch injects Authorization and tracing headers
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^Bearer /
Received string:  ""

[Killed] BlockStatement
src/lib/http.ts:68:7
   }
 
   let res: Response;
-  try {
-    res = await fetch(url, {
-      ...opts,
-      headers: { ...traceHeaders, ...(opts?.headers as Record<string, string>) },
-    });
-  } catch (networkErr) {
+  try {} catch (networkErr) {
     // When APIM returns 429 on the OPTIONS preflight without CORS headers,
     // the browser blocks the request and fetch() throws a TypeError.
killedBy: AdminProductsPage loads and displays products for admin users
statusReason: Error: Unable to find an element with the text: Laptop. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ObjectLiteral
src/lib/http.ts:71:16
   try {
     res = await fetch(url, {
       ...opts,
-      headers: { ...traceHeaders, ...(opts?.headers as Record<string, string>) },
+      headers: {},
     });
   } catch (networkErr) {
killedBy: http module doFetch injects Authorization and tracing headers
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "Authorization"
Received path: []

Received value: {}

[Killed] BlockStatement
src/lib/http.ts:73:24
       ...opts,
       headers: { ...traceHeaders, ...(opts?.headers as Record<string, string>) },
     });
-  } catch (networkErr) {
-    // When APIM returns 429 on the OPTIONS preflight without CORS headers,
-    // the browser blocks the request and fetch() throws a TypeError.
-    // Dispatch rate-limit event so the global banner is shown.
-    window.dispatchEvent(new CustomEvent("api:rate-limit"));
-    const { ApiError } = await import("./api");
-    throw new ApiError(429, null, "Rate limit exceeded");
-  }
+  } catch (networkErr) {}
 
   const contentType = res.headers.get("content-type") || "";
killedBy: http module doFetch dispatches rate-limit event and throws ApiError(429) on network error
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "status": 429,
- }

[Survived] StringLiteral
src/lib/http.ts:79:35
     // Dispatch rate-limit event so the global banner is shown.
     window.dispatchEvent(new CustomEvent("api:rate-limit"));
     const { ApiError } = await import("./api");
-    throw new ApiError(429, null, "Rate limit exceeded");
+    throw new ApiError(429, null, "");
   }
 

[Killed] LogicalOperator
src/lib/http.ts:82:23
     throw new ApiError(429, null, "Rate limit exceeded");
   }
 
-  const contentType = res.headers.get("content-type") || "";
+  const contentType = res.headers.get("content-type") && "";
   const text = await res.text();
   let parsed: any = null;
killedBy: http module doFetch parses JSON response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: "{\"foo\":\"bar\"}"

[Killed] BlockStatement
src/lib/http.ts:85:13
   const contentType = res.headers.get("content-type") || "";
   const text = await res.text();
   let parsed: any = null;
-  if (text) {
-    try {
-      parsed = contentType.includes("application/json")
-        ? JSON.parse(text)
-        : text;
-    } catch {
-      parsed = text;
-    }
-  }
+  if (text) {}
 
   if (!res.ok) {
killedBy: http module doFetch parses JSON response
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"foo": "bar"}
Received: null

[Killed] ConditionalExpression
src/lib/http.ts:85:7
   const contentType = res.headers.get("content-type") || "";
   const text = await res.text();
   let parsed: any = null;
-  if (text) {
+  if (false) {
     try {
       parsed = contentType.includes("application/json")
killedBy: AdminProductsPage loads and displays products for admin users
statusReason: Error: Unable to find an element with the text: Laptop. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] BlockStatement
src/lib/http.ts:86:9
   const text = await res.text();
   let parsed: any = null;
   if (text) {
-    try {
-      parsed = contentType.includes("application/json")
-        ? JSON.parse(text)
-        : text;
-    } catch {
+    try {} catch {
       parsed = text;
     }
killedBy: OrdersPage displays orders after loading
statusReason: Error: Unable to find an element with the text: /3 commandes/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[NoCoverage] BlockStatement
src/lib/http.ts:90:13
       parsed = contentType.includes("application/json")
         ? JSON.parse(text)
         : text;
-    } catch {
-      parsed = text;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
src/lib/http.ts:95:16
     }
   }
 
-  if (!res.ok) {
-    // Also handle 429 that arrives with proper CORS headers
-    if (res.status === 429) {
-      window.dispatchEvent(new CustomEvent("api:rate-limit"));
-    }
-
-    // Lazy import ApiError to avoid circular dependency at module load
-    const { ApiError } = await import("./api");
-    throw new ApiError(res.status, parsed);
-  }
+  if (!res.ok) {}
   return parsed;
 }
killedBy: CatalogPage handles API error with array payload (validation errors)
statusReason: TypeError: Cannot read properties of undefined (reading 'slice')

[Killed] ConditionalExpression
src/lib/http.ts:97:9
 
   if (!res.ok) {
     // Also handle 429 that arrives with proper CORS headers
-    if (res.status === 429) {
+    if (false) {
       window.dispatchEvent(new CustomEvent("api:rate-limit"));
     }
killedBy: http module doFetch dispatches rate-limit event on 429 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "api:rate-limit"}

Number of calls: 0

[Killed] BlockStatement
src/lib/http.ts:97:29
 
   if (!res.ok) {
     // Also handle 429 that arrives with proper CORS headers
-    if (res.status === 429) {
-      window.dispatchEvent(new CustomEvent("api:rate-limit"));
-    }
+    if (res.status === 429) {}
 
     // Lazy import ApiError to avoid circular dependency at module load
killedBy: http module doFetch dispatches rate-limit event on 429 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "api:rate-limit"}

Number of calls: 0

[Killed] StringLiteral
src/lib/http.ts:98:44
   if (!res.ok) {
     // Also handle 429 that arrives with proper CORS headers
     if (res.status === 429) {
-      window.dispatchEvent(new CustomEvent("api:rate-limit"));
+      window.dispatchEvent(new CustomEvent(""));
     }
 
killedBy: http module doFetch dispatches rate-limit event on 429 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"type": "api:rate-limit"}
Received: {"isTrusted": false}

Number of calls: 1
