[Killed] ConditionalExpression
src/lib/cart.tsx:23:16
   switch (action.type) {
     case "ADD": {
       const existing = state.items.find(
-        (i) => i.product.id === action.product.id
+        (i) => false
       );
       if (existing)
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"product": {"category": "Informatique", "id": "p1", "name": "Laptop", "price": 999}, "quantity": 1}, {"product": {"category": "Informatique", "id": "p1", "name": "Laptop", "price": 999}, "quantity": 1}]

[Killed] EqualityOperator
src/lib/cart.tsx:23:16
   switch (action.type) {
     case "ADD": {
       const existing = state.items.find(
-        (i) => i.product.id === action.product.id
+        (i) => i.product.id !== action.product.id
       );
       if (existing)
killedBy: CartPage displays cart items with product details
statusReason: TestingLibraryElementError: Unable to find an element with the text: Headphones. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ArrowFunction
src/lib/cart.tsx:28:34
       if (existing)
         return {
           ...state,
-          items: state.items.map((i) =>
-            i.product.id === action.product.id
-              ? { ...i, quantity: i.quantity + 1 }
-              : i
+          items: state.items.map(() => undefined
           ),
         };
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: TypeError: Cannot read properties of undefined (reading 'product')

[Killed] ConditionalExpression
src/lib/cart.tsx:29:13
         return {
           ...state,
           items: state.items.map((i) =>
-            i.product.id === action.product.id
+            false
               ? { ...i, quantity: i.quantity + 1 }
               : i
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/lib/cart.tsx:29:13
         return {
           ...state,
           items: state.items.map((i) =>
-            i.product.id === action.product.id
+            i.product.id !== action.product.id
               ? { ...i, quantity: i.quantity + 1 }
               : i
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
src/lib/cart.tsx:30:35
           ...state,
           items: state.items.map((i) =>
             i.product.id === action.product.id
-              ? { ...i, quantity: i.quantity + 1 }
+              ? { ...i, quantity: i.quantity - 1 }
               : i
           ),
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/lib/cart.tsx:42:42
     case "REMOVE":
       return {
         ...state,
-        items: state.items.filter((i) => i.product.id !== action.id),
+        items: state.items.filter((i) => false),
       };
     case "SET_QTY":
killedBy: Cart (useCart + CartProvider) REMOVE removes a product by id
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/lib/cart.tsx:42:42
     case "REMOVE":
       return {
         ...state,
-        items: state.items.filter((i) => i.product.id !== action.id),
+        items: state.items.filter((i) => true),
       };
     case "SET_QTY":
killedBy: Cart (useCart + CartProvider) REMOVE removes a product by id
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"product": {"category": "Informatique", "id": "p1", "name": "Laptop", "price": 999}, "quantity": 1}, {"product": {"category": "Audio", "id": "p2", "name": "Headphones", "price": 49}, "quantity": 1}]

[Killed] ConditionalExpression
src/lib/cart.tsx:44:5
         ...state,
         items: state.items.filter((i) => i.product.id !== action.id),
       };
-    case "SET_QTY":
-      if (action.qty <= 0)
-        return {
-          ...state,
-          items: state.items.filter((i) => i.product.id !== action.id),
-        };
-      return {
-        ...state,
-        items: state.items.map((i) =>
-          i.product.id === action.id ? { ...i, quantity: action.qty } : i
-        ),
-      };
+    case "SET_QTY":
     case "CLEAR":
       return { ...state, items: [] };
killedBy: Cart (useCart + CartProvider) SET_QTY updates quantity
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] EqualityOperator
src/lib/cart.tsx:45:11
         items: state.items.filter((i) => i.product.id !== action.id),
       };
     case "SET_QTY":
-      if (action.qty <= 0)
+      if (action.qty < 0)
         return {
           ...state,
killedBy: Cart (useCart + CartProvider) SET_QTY with qty <= 0 removes the item
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"product": {"category": "Informatique", "id": "p1", "name": "Laptop", "price": 999}, "quantity": 0}]

[Killed] EqualityOperator
src/lib/cart.tsx:45:11
         items: state.items.filter((i) => i.product.id !== action.id),
       };
     case "SET_QTY":
-      if (action.qty <= 0)
+      if (action.qty > 0)
         return {
           ...state,
killedBy: Cart (useCart + CartProvider) SET_QTY updates quantity
statusReason: TypeError: Cannot read properties of undefined (reading 'quantity')

[Killed] EqualityOperator
src/lib/cart.tsx:48:44
       if (action.qty <= 0)
         return {
           ...state,
-          items: state.items.filter((i) => i.product.id !== action.id),
+          items: state.items.filter((i) => i.product.id === action.id),
         };
       return {
killedBy: CartPage decrements quantity when − is clicked (removes at 0)
statusReason: Error: Unable to find an element with the text: Votre panier est vide. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Killed] ArrowFunction
src/lib/cart.tsx:52:32
         };
       return {
         ...state,
-        items: state.items.map((i) =>
-          i.product.id === action.id ? { ...i, quantity: action.qty } : i
+        items: state.items.map(() => undefined
         ),
       };
killedBy: CartPage increments quantity when + is clicked
statusReason: TypeError: Cannot read properties of undefined (reading 'product')

[Killed] EqualityOperator
src/lib/cart.tsx:53:11
       return {
         ...state,
         items: state.items.map((i) =>
-          i.product.id === action.id ? { ...i, quantity: action.qty } : i
+          i.product.id !== action.id ? { ...i, quantity: action.qty } : i
         ),
       };
killedBy: CartPage increments quantity when + is clicked
statusReason: Error: Unable to find an element with the text: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        class="page-header"

[Survived] ConditionalExpression
src/lib/cart.tsx:53:11
       return {
         ...state,
         items: state.items.map((i) =>
-          i.product.id === action.id ? { ...i, quantity: action.qty } : i
+          true ? { ...i, quantity: action.qty } : i
         ),
       };

[Killed] ConditionalExpression
src/lib/cart.tsx:56:5
           i.product.id === action.id ? { ...i, quantity: action.qty } : i
         ),
       };
-    case "CLEAR":
-      return { ...state, items: [] };
+    case "CLEAR":
     default:
       return state;
killedBy: Cart (useCart + CartProvider) CLEAR empties the cart
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 2
Received array:  [{"product": {"category": "Informatique", "id": "p1", "name": "Laptop", "price": 999}, "quantity": 1}, {"product": {"category": "Audio", "id": "p2", "name": "Headphones", "price": 49}, "quantity": 1}]

[NoCoverage] ConditionalExpression
src/lib/cart.tsx:58:5
       };
     case "CLEAR":
       return { ...state, items: [] };
-    default:
-      return state;
+    default:
   }
 }

[Killed] ArrowFunction
src/lib/cart.tsx:76:5
     userId: "",
   });
   const total = state.items.reduce(
-    (s, i) => s + i.product.price * i.quantity,
+    () => undefined,
     0
   );
killedBy: Cart (useCart + CartProvider) ADD adds a product with quantity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: undefined

[Killed] ArithmeticOperator
src/lib/cart.tsx:76:19
     userId: "",
   });
   const total = state.items.reduce(
-    (s, i) => s + i.product.price * i.quantity,
+    (s, i) => s + i.product.price / i.quantity,
     0
   );
killedBy: Cart (useCart + CartProvider) ADD same product increments quantity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1998
Received: 499.5

[Killed] ArrowFunction
src/lib/cart.tsx:79:36
     (s, i) => s + i.product.price * i.quantity,
     0
   );
-  const count = state.items.reduce((s, i) => s + i.quantity, 0);
+  const count = state.items.reduce(() => undefined, 0);
   return (
     <Ctx.Provider value={{ state, dispatch, total, count }}>
killedBy: Cart (useCart + CartProvider) ADD adds a product with quantity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/lib/cart.tsx:79:46
     (s, i) => s + i.product.price * i.quantity,
     0
   );
-  const count = state.items.reduce((s, i) => s + i.quantity, 0);
+  const count = state.items.reduce((s, i) => s - i.quantity, 0);
   return (
     <Ctx.Provider value={{ state, dispatch, total, count }}>
killedBy: Cart (useCart + CartProvider) ADD adds a product with quantity 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/lib/cart.tsx:89:7
 
 export function useCart() {
   const ctx = useContext(Ctx);
-  if (!ctx) throw new Error("useCart outside CartProvider");
+  if (true) throw new Error("useCart outside CartProvider");
   return ctx;
 }
killedBy: CartPage shows empty state when cart is empty
statusReason: Error: useCart outside CartProvider

[Killed] BooleanLiteral
src/lib/cart.tsx:89:7
 
 export function useCart() {
   const ctx = useContext(Ctx);
-  if (!ctx) throw new Error("useCart outside CartProvider");
+  if (ctx) throw new Error("useCart outside CartProvider");
   return ctx;
 }
killedBy: OrdersPage renders loading skeletons initially
statusReason: Error: useCart outside CartProvider
