[Killed] ConditionalExpression
src/lib/config.ts:8:37
 }
 
 const runtimeConfig =
-  typeof window !== "undefined" && (window.__APP_CONFIG__ || {});
+  typeof window !== "undefined" && (true);
 
 const envOr = (key: string, fallback: string) =>
killedBy: config API_CONFIG prefers window.__APP_CONFIG__ over env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://from-runtime.com"
Received: "http://from-env.com"

[Killed] ConditionalExpression
src/lib/config.ts:8:3
 }
 
 const runtimeConfig =
-  typeof window !== "undefined" && (window.__APP_CONFIG__ || {});
+  false;
 
 const envOr = (key: string, fallback: string) =>
killedBy: config API_CONFIG prefers window.__APP_CONFIG__ over env
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://from-runtime.com"
Received: "http://from-env.com"

[Killed] LogicalOperator
src/lib/config.ts:11:3
   typeof window !== "undefined" && (window.__APP_CONFIG__ || {});
 
 const envOr = (key: string, fallback: string) =>
-  (runtimeConfig && runtimeConfig[key]) ||
-  (process.env[("REACT_APP_" + key) as keyof NodeJS.ProcessEnv] as string) ||
+  runtimeConfig && runtimeConfig[key] && process.env["REACT_APP_" + key as keyof NodeJS.ProcessEnv] as string ||
   fallback;
 
killedBy: keycloak service with auth disabled initKeycloak returns true without calling keycloak.init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
src/lib/config.ts:11:3
   typeof window !== "undefined" && (window.__APP_CONFIG__ || {});
 
 const envOr = (key: string, fallback: string) =>
-  (runtimeConfig && runtimeConfig[key]) ||
-  (process.env[("REACT_APP_" + key) as keyof NodeJS.ProcessEnv] as string) ||
-  fallback;
+  (runtimeConfig && runtimeConfig[key] || process.env["REACT_APP_" + key as keyof NodeJS.ProcessEnv] as string) && fallback;
 
 export const API_CONFIG = {
killedBy: CatalogPage submits search form with filters
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/lib/config.ts:17:27
 
 export const API_CONFIG = {
   CATALOG: envOr("CATALOG", "http://localhost:4000"),
-  ORDERS: envOr("ORDERS", "http://localhost:8000"),
+  ORDERS: envOr("ORDERS", ""),
   PAYMENT: envOr("PAYMENT", "http://localhost:8082"),
 };
killedBy: config API_CONFIG uses fallback values when no env or runtime config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "http://localhost:8000"
Received: ""

[Killed] StringLiteral
src/lib/config.ts:24:42
 export const KEYCLOAK_CONFIG = {
   URL: envOr("KEYCLOAK_URL", "http://localhost:8080"),
   REALM: envOr("KEYCLOAK_REALM", "ecommerce"),
-  CLIENT_ID: envOr("KEYCLOAK_CLIENT_ID", "ecommerce-front"),
+  CLIENT_ID: envOr("KEYCLOAK_CLIENT_ID", ""),
 };
 
killedBy: config KEYCLOAK_CONFIG has sensible defaults
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ecommerce-front"
Received: ""

[Killed] EqualityOperator
src/lib/config.ts:28:10
 };
 
 export function isAuthEnabled(): boolean {
-  return envOr("AUTH_ENABLED", "true") !== "false";
+  return envOr("AUTH_ENABLED", "true") === "false";
 }
 
killedBy: config isAuthEnabled returns true by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/lib/config.ts:28:10
 };
 
 export function isAuthEnabled(): boolean {
-  return envOr("AUTH_ENABLED", "true") !== "false";
+  return true;
 }
 
killedBy: keycloak service with auth disabled initKeycloak returns true without calling keycloak.init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined
