[Killed] BooleanLiteral
src/services/keycloak.ts:11:7
 });
 
 export async function initKeycloak(): Promise<boolean> {
-  if (!isAuthEnabled()) {
+  if (isAuthEnabled()) {
     return true;
   }
killedBy: keycloak service with auth disabled initKeycloak returns true without calling keycloak.init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/services/keycloak.ts:11:25
 });
 
 export async function initKeycloak(): Promise<boolean> {
-  if (!isAuthEnabled()) {
-    return true;
-  }
+  if (!isAuthEnabled()) {}
 
   const token = sessionStorage.getItem("kc_token") || undefined;
killedBy: keycloak service with auth disabled initKeycloak returns true without calling keycloak.init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/services/keycloak.ts:12:12
 
 export async function initKeycloak(): Promise<boolean> {
   if (!isAuthEnabled()) {
-    return true;
+    return false;
   }
 
killedBy: keycloak service with auth disabled initKeycloak returns true without calling keycloak.init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/keycloak.ts:15:17
     return true;
   }
 
-  const token = sessionStorage.getItem("kc_token") || undefined;
+  const token = sessionStorage.getItem("kc_token") && undefined;
   const refreshToken = sessionStorage.getItem("kc_refreshToken") || undefined;
   const idToken = sessionStorage.getItem("kc_idToken") || undefined;
killedBy: keycloak service with auth enabled initKeycloak restores tokens from sessionStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"idToken": "stored-id", "refreshToken": "stored-refresh", "token": "stored-token"}
Received: {"checkLoginIframe": false, "idToken": "stored-id", "onLoad": "login-required", "refreshToken": "stored-refresh", "token": undefined}

Number of calls: 1

[Killed] StringLiteral
src/services/keycloak.ts:15:40
     return true;
   }
 
-  const token = sessionStorage.getItem("kc_token") || undefined;
+  const token = sessionStorage.getItem("") || undefined;
   const refreshToken = sessionStorage.getItem("kc_refreshToken") || undefined;
   const idToken = sessionStorage.getItem("kc_idToken") || undefined;
killedBy: keycloak service with auth enabled initKeycloak restores tokens from sessionStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"idToken": "stored-id", "refreshToken": "stored-refresh", "token": "stored-token"}
Received: {"checkLoginIframe": false, "idToken": "stored-id", "onLoad": "login-required", "refreshToken": "stored-refresh", "token": undefined}

Number of calls: 1

[Killed] LogicalOperator
src/services/keycloak.ts:16:24
   }
 
   const token = sessionStorage.getItem("kc_token") || undefined;
-  const refreshToken = sessionStorage.getItem("kc_refreshToken") || undefined;
+  const refreshToken = sessionStorage.getItem("kc_refreshToken") && undefined;
   const idToken = sessionStorage.getItem("kc_idToken") || undefined;
 
killedBy: keycloak service with auth enabled initKeycloak restores tokens from sessionStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"idToken": "stored-id", "refreshToken": "stored-refresh", "token": "stored-token"}
Received: {"checkLoginIframe": false, "idToken": "stored-id", "onLoad": "login-required", "refreshToken": undefined, "token": "stored-token"}

Number of calls: 1

[Killed] StringLiteral
src/services/keycloak.ts:16:47
   }
 
   const token = sessionStorage.getItem("kc_token") || undefined;
-  const refreshToken = sessionStorage.getItem("kc_refreshToken") || undefined;
+  const refreshToken = sessionStorage.getItem("") || undefined;
   const idToken = sessionStorage.getItem("kc_idToken") || undefined;
 
killedBy: keycloak service with auth enabled initKeycloak restores tokens from sessionStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"idToken": "stored-id", "refreshToken": "stored-refresh", "token": "stored-token"}
Received: {"checkLoginIframe": false, "idToken": "stored-id", "onLoad": "login-required", "refreshToken": undefined, "token": "stored-token"}

Number of calls: 1

[Killed] LogicalOperator
src/services/keycloak.ts:17:19
 
   const token = sessionStorage.getItem("kc_token") || undefined;
   const refreshToken = sessionStorage.getItem("kc_refreshToken") || undefined;
-  const idToken = sessionStorage.getItem("kc_idToken") || undefined;
+  const idToken = sessionStorage.getItem("kc_idToken") && undefined;
 
   const authenticated = await keycloak.init({
killedBy: keycloak service with auth enabled initKeycloak restores tokens from sessionStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"idToken": "stored-id", "refreshToken": "stored-refresh", "token": "stored-token"}
Received: {"checkLoginIframe": false, "idToken": undefined, "onLoad": "login-required", "refreshToken": "stored-refresh", "token": "stored-token"}

Number of calls: 1

[Survived] BooleanLiteral
src/services/keycloak.ts:21:23
 
   const authenticated = await keycloak.init({
     onLoad: "login-required",
-    checkLoginIframe: false,
+    checkLoginIframe: true,
     token,
     refreshToken,

[Killed] ConditionalExpression
src/services/keycloak.ts:27:7
     idToken
   });
 
-  if (authenticated) {
+  if (false) {
     sessionStorage.setItem("kc_token", keycloak.token!);
     sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
killedBy: keycloak service with auth enabled initKeycloak calls keycloak.init and stores tokens on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "real-token"
Received: null

[Killed] BlockStatement
src/services/keycloak.ts:27:22
     idToken
   });
 
-  if (authenticated) {
-    sessionStorage.setItem("kc_token", keycloak.token!);
-    sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
-    sessionStorage.setItem("kc_idToken", keycloak.idToken!);
-  }
+  if (authenticated) {}
 
   // Keep sessionStorage in sync when tokens are refreshed
killedBy: keycloak service with auth enabled initKeycloak calls keycloak.init and stores tokens on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "real-token"
Received: null

[Killed] StringLiteral
src/services/keycloak.ts:29:28
 
   if (authenticated) {
     sessionStorage.setItem("kc_token", keycloak.token!);
-    sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
+    sessionStorage.setItem("", keycloak.refreshToken!);
     sessionStorage.setItem("kc_idToken", keycloak.idToken!);
   }
killedBy: keycloak service with auth enabled initKeycloak calls keycloak.init and stores tokens on success
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "real-refresh"
Received: null

[Killed] BlockStatement
src/services/keycloak.ts:34:35
   }
 
   // Keep sessionStorage in sync when tokens are refreshed
-  keycloak.onTokenExpired = () => {
-    keycloak.updateToken(30).then(() => {
-      sessionStorage.setItem("kc_token", keycloak.token!);
-      sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
-      sessionStorage.setItem("kc_idToken", keycloak.idToken!);
-    });
-  };
+  keycloak.onTokenExpired = () => {};
 
   return authenticated;
killedBy: keycloak service with auth enabled onTokenExpired refreshes and stores new tokens
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 30

Number of calls: 0

[Killed] BlockStatement
src/services/keycloak.ts:35:41
 
   // Keep sessionStorage in sync when tokens are refreshed
   keycloak.onTokenExpired = () => {
-    keycloak.updateToken(30).then(() => {
-      sessionStorage.setItem("kc_token", keycloak.token!);
-      sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
-      sessionStorage.setItem("kc_idToken", keycloak.idToken!);
-    });
+    keycloak.updateToken(30).then(() => {});
   };
 
killedBy: keycloak service with auth enabled onTokenExpired refreshes and stores new tokens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "new-token"
Received: "real-token"

[Survived] StringLiteral
src/services/keycloak.ts:38:30
     keycloak.updateToken(30).then(() => {
       sessionStorage.setItem("kc_token", keycloak.token!);
       sessionStorage.setItem("kc_refreshToken", keycloak.refreshToken!);
-      sessionStorage.setItem("kc_idToken", keycloak.idToken!);
+      sessionStorage.setItem("", keycloak.idToken!);
     });
   };

[Killed] BooleanLiteral
src/services/keycloak.ts:46:7
 }
 
 export async function getToken(): Promise<string> {
-  if (!isAuthEnabled()) {
+  if (isAuthEnabled()) {
     return "";
   }
killedBy: keycloak service with auth disabled getToken returns empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "real-token"

[Killed] ConditionalExpression
src/services/keycloak.ts:46:7
 }
 
 export async function getToken(): Promise<string> {
-  if (!isAuthEnabled()) {
+  if (false) {
     return "";
   }
killedBy: keycloak service with auth disabled getToken returns empty string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "real-token"

[Killed] BooleanLiteral
src/services/keycloak.ts:54:7
 }
 
 export function getUsername(): string {
-  if (!isAuthEnabled()) {
+  if (isAuthEnabled()) {
     return "anonymous";
   }
killedBy: keycloak service with auth disabled getUsername returns 'anonymous'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "anonymous"
Received: "john"

[Killed] ConditionalExpression
src/services/keycloak.ts:54:7
 }
 
 export function getUsername(): string {
-  if (!isAuthEnabled()) {
+  if (true) {
     return "anonymous";
   }
killedBy: keycloak service with auth enabled getUsername returns preferred_username from tokenParsed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john"
Received: "anonymous"

[Killed] StringLiteral
src/services/keycloak.ts:55:12
 
 export function getUsername(): string {
   if (!isAuthEnabled()) {
-    return "anonymous";
+    return "";
   }
   return keycloak.tokenParsed?.preferred_username ?? "";
killedBy: keycloak service with auth disabled getUsername returns 'anonymous'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "anonymous"
Received: ""

[Killed] LogicalOperator
src/services/keycloak.ts:57:10
   if (!isAuthEnabled()) {
     return "anonymous";
   }
-  return keycloak.tokenParsed?.preferred_username ?? "";
+  return keycloak.tokenParsed?.preferred_username && "";
 }
 
killedBy: keycloak service with auth enabled getUsername returns preferred_username from tokenParsed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "john"
Received: ""

[Survived] OptionalChaining
src/services/keycloak.ts:57:10
   if (!isAuthEnabled()) {
     return "anonymous";
   }
-  return keycloak.tokenParsed?.preferred_username ?? "";
+  return keycloak.tokenParsed.preferred_username ?? "";
 }
 

[Killed] BlockStatement
src/services/keycloak.ts:61:25
 }
 
 export function getUserId(): string {
-  if (!isAuthEnabled()) {
-    return "anonymous";
-  }
+  if (!isAuthEnabled()) {}
   return keycloak.tokenParsed?.sub ?? "";
 }
killedBy: keycloak service with auth disabled getUserId returns 'anonymous'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "anonymous"
Received: "sub-456"

[Killed] ConditionalExpression
src/services/keycloak.ts:61:7
 }
 
 export function getUserId(): string {
-  if (!isAuthEnabled()) {
+  if (false) {
     return "anonymous";
   }
killedBy: keycloak service with auth disabled getUserId returns 'anonymous'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "anonymous"
Received: "sub-456"

[Killed] LogicalOperator
src/services/keycloak.ts:64:10
   if (!isAuthEnabled()) {
     return "anonymous";
   }
-  return keycloak.tokenParsed?.sub ?? "";
+  return keycloak.tokenParsed?.sub && "";
 }
 
killedBy: keycloak service with auth enabled getUserId returns sub from tokenParsed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "sub-456"
Received: ""

[Survived] OptionalChaining
src/services/keycloak.ts:64:10
   if (!isAuthEnabled()) {
     return "anonymous";
   }
-  return keycloak.tokenParsed?.sub ?? "";
+  return keycloak.tokenParsed.sub ?? "";
 }
 

[Killed] ConditionalExpression
src/services/keycloak.ts:68:7
 }
 
 export function hasRole(role: string): boolean {
-  if (!isAuthEnabled()) {
+  if (false) {
     return true;
   }
killedBy: keycloak service with auth disabled hasRole returns true for any role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/services/keycloak.ts:68:7
 }
 
 export function hasRole(role: string): boolean {
-  if (!isAuthEnabled()) {
+  if (isAuthEnabled()) {
     return true;
   }
killedBy: keycloak service with auth disabled hasRole returns true for any role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/services/keycloak.ts:72:10
     return true;
   }
   const roles = (keycloak.tokenParsed as any)?.realm_access?.roles as string[] | undefined;
-  return roles?.includes(role) ?? false;
+  return roles?.includes(role) && false;
 }
 
killedBy: keycloak service with auth enabled hasRole returns true when user has the role
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] OptionalChaining
src/services/keycloak.ts:72:10
     return true;
   }
   const roles = (keycloak.tokenParsed as any)?.realm_access?.roles as string[] | undefined;
-  return roles?.includes(role) ?? false;
+  return roles.includes(role) ?? false;
 }
 

[Killed] BlockStatement
src/services/keycloak.ts:75:32
   return roles?.includes(role) ?? false;
 }
 
-export function logout(): void {
-  if (!isAuthEnabled()) {
-    return;
-  }
-  sessionStorage.removeItem("kc_token");
-  sessionStorage.removeItem("kc_refreshToken");
-  sessionStorage.removeItem("kc_idToken");
-  keycloak.logout({ redirectUri: window.location.origin });
-}
+export function logout(): void {}
 
killedBy: keycloak service with auth enabled logout clears sessionStorage and calls keycloak.logout
statusReason: Error: expect(received).toBeNull()

Received: "t"

[Killed] BlockStatement
src/services/keycloak.ts:76:25
 }
 
 export function logout(): void {
-  if (!isAuthEnabled()) {
-    return;
-  }
+  if (!isAuthEnabled()) {}
   sessionStorage.removeItem("kc_token");
   sessionStorage.removeItem("kc_refreshToken");
killedBy: keycloak service with auth disabled logout does nothing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"redirectUri": "http://localhost"}

[Killed] BooleanLiteral
src/services/keycloak.ts:76:7
 }
 
 export function logout(): void {
-  if (!isAuthEnabled()) {
+  if (isAuthEnabled()) {
     return;
   }
killedBy: keycloak service with auth disabled logout does nothing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"redirectUri": "http://localhost"}

[Killed] ObjectLiteral
src/services/keycloak.ts:82:19
   sessionStorage.removeItem("kc_token");
   sessionStorage.removeItem("kc_refreshToken");
   sessionStorage.removeItem("kc_idToken");
-  keycloak.logout({ redirectUri: window.location.origin });
+  keycloak.logout({});
 }
 
killedBy: keycloak service with auth enabled logout clears sessionStorage and calls keycloak.logout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "redirectUri": "http://localhost",
- }
